Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyNoExternalParametersError Property
 Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyNoExternalParametersError { get; }
Public Shared ReadOnly Property FamilyNoExternalParametersError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyNoExternalParametersError {
	FailureDefinitionId^ get ();
}
static member FamilyNoExternalParametersError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace